Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If a bean class annotated with one of the health check annotations declares no scope then the `@Singleton` scope is used automatically.
ja_jp: アノテーションされたBeanクラスがスコープを宣言していない場合、 `@Singleton` のスコープが自動的に使用されます。

source: If a bean registered by an `AdditionalBeanBuildItem` does not specify a scope then `@Dependent` is assumed.
ja_jp: `AdditionalBeanBuildItem` で登録された Bean がスコープを指定しない場合は `@Dependent` とする。

source: If a channel is configured to be pausable, you can get the `PausableChannel` by channel name from the `ChannelRegistry` programmatically, and pause or resume the channel as needed:
ja_jp: チャネルが一時停止可能に設定されている場合は、プログラにより `ChannelRegistry` からチャネル名で `PausableChannel` を取得し、必要に応じてチャネルを一時停止または再開できます。

source: If a class is annotated with `@Startup` but with no scope annotation then `@ApplicationScoped` is added automatically.
ja_jp: クラスが `@Startup` でアノテーションされていて、スコープのアノテーションがない場合は、 `@ApplicationScoped` が自動的に追加されます。

source: If a class is annotated with `@TemplateGlobal` then every non-void non-private static method that declares no parameters and every non-private static field is considered a global variable. The name is defaulted, i.e. the name of the field/method is used.
ja_jp: クラスが `@TemplateGlobal` でアノテーションが付けられている場合、パラメーターを宣言しないすべての非 void 非プライベート静的メソッドとすべての非プライベート静的フィールドは、グローバル変数と見なされます。名前はデフォルトです。つまり、フィールド/メソッドの名前が使用されます。

source: If a class that implements `QuarkusApplication` and has a Java main then the Java main will be run.
ja_jp: `QuarkusApplication` を実装したクラスで Java main がある場合は Java main が実行されます。

source: If a client made the following HTTP call:
ja_jp: クライアントが次の HTTP 呼び出しを行った場合:

source: If a compatible terminal is detected Quarkus will display status messages at the bottom of the console window, and react to input without the need to press enter. If this interferes with your application it can be disabled via `quarkus.test.basic-console=true` (note that gradle will always use the basic console at this time).
ja_jp: 互換性のある端末が検出された場合、Quarkusはコンソールウィンドウの下部にステータスメッセージを表示し、Enterキーを押すことなく入力に反応します。これがアプリケーションの邪魔になる場合は、 `quarkus.test.basic-console=true` で無効にすることができます（現時点では、gradleは常に基本コンソールを使用することに注意してください）。

source: If a configuration is associated with a default value (by way of the `io.smallrye.config.WithDefault` or `org.eclipse.microprofile.config.inject.ConfigProperty.defaultValue`), and no configuration value is supplied for the property, then rather than throwing an exception, the default value will be used. A default value is expressed as a `String`, and uses the same conversion mechanism used to process configuration values. Several Built-in Converters already exist for primitives, boxed primitives, and other classes; for example:
ja_jp: 設定に (`io.smallrye.config.WithDefault` または `org.eclipse.microprofile.config.inject.ConfigProperty.defaultValue` によって) デフォルト値が関連付けられており、プロパティーに設定値が提供されていない場合、例外をスローするのではなく、デフォルト値が使用されます。デフォルト値は `String` として表現され、設定値の処理に使用されるのと同じ変換メカニズムを使用します。プリミティブ、ボックス化されたプリミティブ、およびその他のクラス向けに、いくつかの組み込みコンバーターが既に存在します。例:

source: If a custom `TenantResolver` is used and you would like to combine REST/HTTP and WebSockets, the code may look like this:
ja_jp: カスタムの `TenantResolver` を使用し、REST/HTTP と WebSocket を組み合わせる場合、コードは次のようになります。

source: If a custom realm file has to be imported into Keycloak before running the tests then you can configure `Dev Services for Keycloak` as follows:
ja_jp: テストを実行する前にカスタムレルムファイルを Keycloak にインポートする必要がある場合は、次のように `Dev Services for Keycloak` を設定できます。

source: If a custom realm file has to be imported into Keycloak before running the tests, configure `Dev Services for Keycloak` as follows:
ja_jp: テストを実行する前にカスタムレルムファイルを Keycloak にインポートする必要がある場合は、次のように `Dev Services for Keycloak` を設定します。

source: If a custom realm file has to be imported into Keycloak before running the tests, then you can configure `Dev Services for Keycloak` as follows:
ja_jp: テストを実行する前に、カスタムレルムファイルを Keycloak にインポートする必要がある場合は、次のように `Dev Services for Keycloak` を設定できます。

source: If a database contains many entities, it might not be a great idea to return them all at once. `PagingAndSortingRepository` allows the `spring-data-rest` extension to access data in chunks.
ja_jp: データベースに大量のエンティティが含まれている場合、それらをすべて一度に返すのは得策ではないかもしれません。 `PagingAndSortingRepository` では、 `spring-data-rest` エクステンションを使って、データをチャンク単位でアクセスすることができます。

source: If a datasource is configured at build time, by default it is active at runtime, that is Quarkus will start the corresponding JDBC connection pool or reactive client on application startup.
ja_jp: データソースがビルド時に設定されている場合、 デフォルトでは実行時にアクティブになります。 つまり、Quarkusはアプリケーションの起動時に対応するJDBC接続プールまたはリアクティブクライアントを開始します。

source: If a datasource is not active:
ja_jp: データソースがアクティブでない場合は、以下のようになります。

source: If a key of a section parameter (aka the name of the local variable) ends with a `?` then the local variable is only set if the key without the `?` suffix resolves to `null` or _"not found"_:
ja_jp: セクションパラメーターのキー (ローカル変数の名前) が `?` で終わる場合、ローカル変数は、 `?` サフィックスのないキーが `null` または _"not found"_ に解決された場合にのみ設定されます。

source: If a key of a section parameter, such as the name of the local variable, ends with a `?`, then the local variable is only set if the key without the `?` suffix resolves to `null` or _"not found"_:
ja_jp: ローカル変数名などのセクションパラメータのキーが `?` で終わっている場合、 `?` を除いたキーが `null` または _"not found"_ に解決される場合にのみ、ローカル変数が設定されます:

source: If a managed bean declares interceptor binding annotations on the class level, the corresponding `@AroundInvoke` interceptors will apply to all business methods. Similarly, the corresponding `@AroundConstruct` interceptors will apply to the bean constructor.
ja_jp: マネージド Bean がクラスレベルでインターセプターバインディングアノテーションを宣言する場合、対応する `@AroundInvoke` インターセプターがすべてのビジネスメソッドに適用されます。同様に、対応する `@AroundConstruct` インターセプターが Bean コンストラクターに適用されます。

source: If a mapping fails to match a configuration property a `NoSuchElementException` is thrown, unless the mapped element is an `Optional`.
ja_jp: マッピングが設定プロパティと一致しない場合、マッピングされた要素が `Optional` でない限り、 `NoSuchElementException` がスローされます。

source: If a message produced from a Kafka record is nacked, a failure strategy is applied. The Kafka connector supports three strategies:
ja_jp: Kafka レコードから生成されたメッセージが nack された場合、エラーストラテジーが適用されます。Kafka コネクターは、次の 3 つのストラテジーをサポートしています。

source: If a message produced from a Pulsar message is *nacked*, a failure strategy is applied. The Quarkus Pulsar extension supports 4 strategies:
ja_jp: Pulsar メッセージから生成されたメッセージが *否定応答* された場合、失敗ストラテジーが適用されます。 Quarkus Pulsar エクステンションは、4 つのストラテジーをサポートしています。

source: If a message produced from a RabbitMQ message is nacked, a failure strategy is applied. The RabbitMQ connector supports three strategies, controlled by the failure-strategy channel setting:
ja_jp: RabbitMQ メッセージから生成されたメッセージがnackされた場合、失敗戦略が適用されます。RabbitMQ コネクターは、失敗戦略チャネルの設定により制御される 3 つの戦略をサポートします。

source: If a message produced from an AMQP message is _nacked_, a failure strategy is applied. The AMQP connector supports six strategies:
ja_jp: AMQP メッセージから生成されたメッセージが _nacked_ の場合、障害戦略が適用されます。AMQP コネクターは、次の 6 つの戦略をサポートしています。

source: If a method annotated with `@ConsumeEvent` throws an exception then:
ja_jp: `@ConsumeEvent` がアノテートされたメソッドが例外を発生させた場合、以下のようになります。

source: If a method annotated with `@ConsumeEvent` throws an exception, then:
ja_jp: `@ConsumeEvent` でアノテーションされたメソッドが例外を発生させた場合、

source: If a method is annotated by mistake with `@AddingSpanAttributes` and `@WithSpan` annotations, the `@WithSpan` annotation will take precedence.
ja_jp: メソッドに誤って `@AddingSpanAttributes` アノテーションと `@WithSpan` アノテーションが付けられている場合は、 `@WithSpan` アノテーションが優先されます。

source: If a method name, or a property name do not match with each other, the `@WithName` annotation can override the method name mapping and use the name supplied in the annotation:
ja_jp: メソッド名やプロパティ名が互いに一致しない場合、 `@WithName` アノテーションはメソッド名のマッピングを上書きし、アノテーションで提供された名前を使用することができます。

source: If a method or class is annotated with `jakarta.transaction.Transactional` then it will also be treated as a blocking method. This is because JTA is a blocking technology, and is generally used with other blocking technology such as Hibernate and JDBC. An explicit `@Blocking` or `@NonBlocking` on the class will override this behaviour.
ja_jp: メソッドやクラスに `jakarta.transaction.Transactional` のアノテーションを付けると、そのメソッドもブロッキングメソッドとして扱われます。これは、JTAがブロッキング技術であり、一般的にHibernateやJDBCなどの他のブロッキング技術と共に使用されるためです。クラスに明示的に `@Blocking` または `@NonBlocking` を付けると、この動作は上書きされます。

source: If a method or class is annotated with `javax.transaction.Transactional` then it will also be treated as a blocking method. This is because JTA is a blocking technology, and is generally used with other blocking technology such as Hibernate and JDBC. An explicit `@Blocking` or `@NonBlocking` on the class will override this behaviour.
ja_jp: メソッドまたはクラスに `javax.transaction.Transactional` アノテーションが付けられている場合、それもブロッキングメソッドとして扱われます。これは、JTA がブロッキングテクノロジーであり、Hibernate や JDBC などの他のブロッキングテクノロジーで一般的に使用されているためです。クラスでの明示的な `@Blocking` または `@NonBlocking` は、この動作をオーバーライドします。

source: If a path is registered with multiple permission sets then any permission sets that specify a HTTP method will take precedence and permissions sets without a method will not be considered (assuming of course the method matches). In this instance, the permission sets without methods will only come into effect if the request method does not match any of the sets with method permissions.
ja_jp: パスが複数のパーミッションセットで登録されている場合、HTTPメソッドを指定するパーミッションセットが優先され、メソッドを持たないパーミッションセットは考慮されません(もちろん、メソッドがマッチすると仮定して)。この例では、リクエストメソッドがメソッドパーミッションセットのどれにもマッチしない場合にのみ、メソッドなしのパーミッションセットが有効になります。

source: If a path is registered with multiple permission sets then any permission sets that specify an HTTP method will take precedence and permissions sets without a method will not be considered (assuming of course the method matches). In this instance, the permission sets without methods will only come into effect if the request method does not match any of the sets with method permissions.
ja_jp: パスが複数の許可セットで登録されている場合、HTTPメソッドを指定する許可セットが優先され、メソッドを持たない許可セットは考慮されません(もちろん、メソッドが一致することを前提としています)。この例では、メソッドを持たないパーミッションセットは、 リクエストメソッドがメソッドパーミッションセットのいずれにもマッチしない場合にのみ 有効になります。

source: If a persistence unit is configured at build time, by default it is active at runtime, that is Quarkus will start the corresponding Hibernate ORM `SessionFactory` on application startup.
ja_jp: ビルド時に永続化ユニットが設定されている場合、 デフォルトでは実行時にもアクティブになります。 つまり、Quarkus はアプリケーションの起動時に対応する Hibernate ORM の `SessionFactory` を開始します。

source: If a persistence unit is not active:
ja_jp: 永続化ユニットがアクティブでない場合は、以下のようになります。

source: If a profile does not define a value for a specific attribute, the _default_ (no profile) value is used:
ja_jp: プロファイルが特定の属性の値を定義していない場合、_デフォルト_ (プロファイルなし) の値が使用されます。

source: If a property is associated with a default value (by way of the `defaultValue` attribute), and no configuration value is supplied for the property, then rather than throwing a `jakarta.enterprise.inject.spi.DeploymentException`, the default value will be used. The `defaultValue` value is expressed as a `String`, and uses the same conversion mechanism used to process configuration values. Several Built-in Converters already exist for primitives, boxed primitives, and other classes; for example:
ja_jp: プロパティが（ `defaultValue` 属性によって）デフォルト値と関連付けられ、そのプロパティに対して設定値が設定されない場合、 `jakarta.enterprise.inject.spi.DeploymentException` を投げるのではなく、デフォルト値が使用されます。 `defaultValue` 値は `String` として表現され、設定値の処理に使用されるのと同じ変換機構が使用されます。プリミティブ、ボックス化されたプリミティブ、その他のクラスには、すでにいくつかの組み込みコンバーターが存在します。例:

source: If a property is associated with a default value (by way of the `defaultValue` attribute), and no configuration value is supplied for the property, then rather than throwing a `javax.enterprise.inject.spi.DeploymentException`, the default value will be used. The `defaultValue` value is expressed as a `String`, and uses the same conversion mechanism used to process configuration values. Several Built-in Converters already exist for primitives, boxed primitives, and other classes; for example:
ja_jp: プロパティーが (`defaultValue` 属性を介して) デフォルト値に関連付けられており、プロパティーに設定値が指定されていない場合、 `javax.enterprise.inject.spi.DeploymentException` をスローせずにデフォルト値が使用されます。 `defaultValue` の値は `String` として表され、設定値の処理に使用されるのと同じ変換メカニズムを使用します。プリミティブ、ボックス化されたプリミティブ、およびその他のクラス用に、いくつかの組み込みコンバーターがすでに存在します。以下に例を示します。

source: If a property is specified via both the Quarkus notation and the MicroProfile notation, the Quarkus notation takes a precedence.
ja_jp: プロパティがQuarkus記法とMicroProfile記法の両方で指定されている場合、Quarkus記法が優先されます。

source: If a record cannot be written, the message is `nacked`.
ja_jp: レコードを書き込めない場合、メッセージは `nacked` になります。

source: If a record cannot be written, the message is nacked.
ja_jp: レコードを書き込めない場合は、メッセージは nack になります。

source: If a request would match one or more permission sets based on the path, but does not match any due to method requirements then the request is rejected.
ja_jp: リクエストがパスに基づいて1つ以上のパーミッションセットにマッチするが、 メソッドの要件によりマッチしない場合、そのリクエストは拒否されます。

source: If a requested cache does not exist, Quarkus creates a cache with a Default configuration on first access. We should be able to reaload the Infinispan Server Console and display the content of the Cache. The Infinispan Server Console uses the https://infinispan.org/docs/stable/titles/rest/rest.html[Infinispan Server REST API]. The content can be displayed in JSON thanks to the Protobuf Encoding that converts to JSON format.
ja_jp: 要求されたキャッシュが存在しない場合、Quarkusは最初のアクセス時にDefault設定でキャッシュを作成します。Infinispan Server コンソールを再読み込みして、キャッシュの内容を表示しましょう。Infinispan Server コンソールは、 link:https://infinispan.org/docs/stable/titles/rest/rest.html[Infinispan Server REST API] を使用しています。JSON形式に変換するProtobuf Encodingのおかげで、コンテンツをJSONで表示できます。

source: If a resource is protected with `@RolesAllowed("user")`, the user `admin` is not authorized to access the resource because it is not assigned to the "user" role, as outlined in the following shell example:
ja_jp: リソースが `@RolesAllowed("user")` で保護されている場合、次のシェルの例で説明するように、ユーザー `admin` は "user" ロールに割り当てられていないため、リソースへのアクセスは許可されません:

source: If a resource is protected with `@RolesAllowed("user")`, the user `admin` is not authorized to access the resource because it is not assigned to the "user" role, as shown in the following example:
ja_jp: リソースが `@RolesAllowed("user")` で保護されている場合は、次の例に示すように、 `admin` ユーザーは "user" ロールに割り当てられていないため、リソースへのアクセスを許可されません。

source: If a serializer/deserializer is set by configuration, it won't be replaced by the autodetection.
ja_jp: シリアライザー/デシリアライザーが設定されている場合、自動検出によって置き換えられることはありません。

source: If a simple build item is declared on a build step, it _must_ be produced during that build step, otherwise an error will result. Build producers which are injected into steps _must not_ be used outside of that step.
ja_jp: 単純なビルド項目がビルド・ステップで宣言された場合、そのビルド・ステップ中に生成され _なければなりません_ 。ステップに注入されたビルド・プロデューサーは、そのステップの外で使用しては _いけません_ 。

source: If a simple build item is declared on a build step, it _must_ be produced during that build step, otherwise an error will result. Build producers, which are injected into steps, _must not_ be used outside that step.
ja_jp: 単純な構築項目が構築ステップで宣言される場合、それはその構築ステップの間に生成されなければならず、さもなければエラーが発生します。ステップに注入されるビルドプロデューサーは、そのステップの外側で使用されては _なりません_。

source: If a single topic contains mixed messages (some with 8-byte IDs, some with 4-byte IDs), consumers using standard ID handlers will fail. A consumer configured with `Legacy8ByteIdHandler` always reads 8 bytes; one with `Default4ByteIdHandler` always reads 4 bytes. Mismatches cause corruption or deserialization errors.
ja_jp: 単一のトピックに混合メッセージ (8 バイト ID のものと 4 バイト ID のもの) が含まれている場合、標準 ID ハンドラーを使用するコンシューマーは失敗します。 `Legacy8ByteIdHandler` で設定されたコンシューマーは常に 8 バイトを読み取り、 `Default4ByteIdHandler` で設定されたコンシューマーは常に 4 バイトを読み取ります。不一致は破損や逆シリアル化エラーを引き起こします。

source: If a subscription name is not provided Quarkus generates a unique id.
ja_jp: サブスクリプション名が指定されていない場合、Quarkus は一意の ID を生成します。

source: If a test profile implementation declares a CDI bean (via producer method/field or nested static class) then this bean is only taken into account if the test profile is used, i.e. it's ignored for any other test profile.
ja_jp: テストプロファイルの実装で CDI Bean が宣言されている場合 (プロデューサーメソッド/フィールドまたはネストされた静的クラス経由)、この Bean はテストプロファイルが使用されている場合にのみ考慮され、他のテストプロファイルでは無視されます。

source: If a tested component class declares an interceptor binding then you might need to mock the interception too. There are two ways to accomplish this task. First, you can define an interceptor class as a static nested class of the test class.
ja_jp: テスト対象のコンポーネントクラスがインターセプターバインディングを宣言している場合は、インターセプションもモック化する必要があるかもしれません。 このタスクを達成するには 2 つの方法があります。 まず、テストクラスのネストされた静的クラスとしてインターセプタークラスを定義できます。

source: If a topic already exists with the given name, the creation is skipped, without trying to re-partition the existing topic to a different number of partitions.
ja_jp: 指定された名前のトピックがすでに存在する場合、既存のトピックを異なる数のパーティションに再分割しようとはせず、作成はスキップされます。

source: If a transaction is already associated with the current thread a `QuarkusTransactionException` will be thrown, otherwise a new transaction is started, and follows all the normal lifecycle rules.
ja_jp: もしトランザクションがすでに現在のスレッドに関連していれば、 `QuarkusTransactionException` が投げられます。そうでなければ、新しいトランザクションが開始され、すべての通常のライフサイクルのルールに従います。

source: If a validation error is triggered, a violation report is generated and serialized as JSON as our end point produces a JSON output. It can be extracted and manipulated to display a proper error message.
ja_jp: 検証エラーが発生した場合、違反レポートが生成され、そしてエンドポイントがJSON出力を生成することによってJSONとしてシリアライズされます。これを抽出して操作することで、適切なエラーメッセージを表示することができます。

source: If all is well quarkus will log:
ja_jp: 順調にいけばquarkusは以下のようにログ出力します。

source: If all that you need is to map the `SecurityIdentity` roles to the deployment-specific roles regardless of a path, you can also do this:
ja_jp: パスに関係なく、 `SecurityIdentity` ロールをデプロイメント固有のロールにマッピングするだけの場合は、次のようにすることもできます。

source: If an AMQP message is rejected/released/modified by the broker (or cannot be sent successfully), the message is nacked.
ja_jp: AMQP メッセージがブローカーによって拒否/解放/変更された場合 (または正常に送信できない場合)、メッセージはナックされます。

source: If an `io.quarkus.cache.CacheKeyGenerator` is declared in a `@CacheResult` or a `@CacheInvalidate` annotation, then it is used to generate the cache key. The `@CacheKey` annotations that might be present on some method arguments are ignored.
ja_jp: `io.quarkus.cache.CacheKeyGenerator` が `@CacheResult` または `@CacheInvalidate` アノテーションで宣言されている場合、キャッシュ・キーの生成に使用されます。いくつかのメソッド引数の存在する可能性のある `@CacheKey` アノテーションは無視されます。

source: If an application attempts to inject a connector for a missing endpoint, an error is thrown.
ja_jp: アプリケーションが、存在しないエンドポイントのコネクターを注入しようとすると、エラーがスローされます。

source: If an application relies on `java.security.Principal` returning a name then a token must have a `upn` or `preferred_username` or `sub` claim set. Setting this property will result in SmallRye JWT throwing an exception if none of these claims is available for the application code to reliably deal with a non-null `Principal` name.
ja_jp: アプリケーションが名前を返す `java.security.Principal` に依存している場合、トークンには `upn` または `preferred_username` または `sub` クレームが設定されている必要があります。このプロパティーを設定すると、アプリケーションコードが null 以外の `Principal` 名を確実に処理するためにこれらのクレームのいずれも使用できない場合に、SmallRye JWT は例外を出力します。

source: If an application relies on `java.security.Principal` returning a name, then a token must have a `upn` or `preferred_username` or `sub` claim set. Setting this property results in SmallRye JWT throwing an exception if none of these claims is available for the application code to deal with a non-null `Principal` name reliably.
ja_jp: アプリケーションが名前を返す `java.security.Principal` に依存している場合、トークンには `upn` または `preferred_username` または `sub` クレームセットが必要です。このプロパティーを設定すると、アプリケーションコードが null 以外の `Principal` 名を確実に処理するためにこれらのクレームがいずれも利用できない場合、SmallRye JWT は例外を出力します。

source: If an argument does not have a name and the value is a single word string literal , such as `"foo"`, then the name is defaulted and quotation marks are removed, e.g. `{#myTag "foo" /}` becomes `{#myTag foo="foo" /}`.
ja_jp: 引数に名前がなく、値が `"foo"` のような 1 つの単語の文字列リテラルである場合、その名前がデフォルトに設定されて引用符は削除されます (たとえば `{#myTag "foo" /}` は `{#myTag foo="foo" /}` になります)。

source: If an endpoint is annotated with `@SessionScoped`, or depends directly or indirectly on a `@SessionScoped` bean, then each WebSocket connection is associated with its own _session context_. The session context is active during endpoint callback invocation. Subsequent invocations of <<callback-methods>> within the same connection utilize the same session context. The session context remains active until the connection is closed (usually when the `@OnClose` method completes execution), at which point it is terminated.
ja_jp: エンドポイントに `@SessionScoped` アノテーションが付与されている場合、またはエンドポイントが直接的または間接的に `@SessionScoped` Bean に依存している場合、各 WebSocket 接続は独自の _セッションコンテキスト_ に関連付けられます。 セッションコンテキストは、エンドポイントコールバックの呼び出し中にアクティブになります。 同じ接続内で後続の <<callback-methods>> が呼び出される場合、同じセッションコンテキストが利用されます。 セッションコンテキストは、接続が閉じられるまで (通常は `@OnClose` メソッドの実行が完了したとき) アクティブなままになり、接続が閉じられた時点で終了します。

source: If an exception is thrown by an asynchronous observer then the `CompletionStage` returned by the `fireAsync()` method completes exceptionally so that the event producer may react appropriately. However, if the event producer does not care then the exception is ignored silently. Therefore, Quarkus logs an error message by default. It is also possible to implement a custom `AsyncObserverExceptionHandler`. A bean that implements this interface should be `@jakarta.inject.Singleton` or `@jakarta.enterprise.context.ApplicationScoped`.
ja_jp: 非同期オブザーバーによって例外が発生した場合、 `fireAsync()` メソッドによって返される `CompletionStage` は例外的に完了し、イベントプロデューサーが適切に対応できるようになります。 ただし、イベントプロデューサーが気にしない場合は、例外は黙って無視されます。 したがって、Quarkus はデフォルトでエラーメッセージをログに記録します。 カスタムの `AsyncObserverExceptionHandler` を実装することも可能です。 このインターフェイスを実装する Bean は、 `@jakarta.inject.Singleton` または `@jakarta.enterprise.context.ApplicationScoped` である必要があります。

source: If an exception is thrown by an asynchronous observer then the `CompletionStage` returned by the `fireAsync()` method completes exceptionally so that the event producer may react appropriately. However, if the event producer does not care then the exception is ignored silently. Therefore, Quarkus logs an error message by default. It is also possible to implement a custom `AsyncObserverExceptionHandler`. A bean that implements this interface should be `@javax.inject.Singleton` or `@javax.enterprise.context.ApplicationScoped`.
ja_jp: 非同期オブザーバーによって例外が出力された場合、 `fireAsync()` メソッドによって返される `CompletionStage` は例外的に完了し、イベントプロデューサーが適切に反応できるようにします。ただし、イベントプロデューサーがこれを問題にしない場合、例外は黙示的に無視されます。したがって、Quarkus はデフォルトでエラーメッセージをログに記録します。カスタムの `AsyncObserverExceptionHandler` を実装することも可能です。このインターフェイスを実装する Bean は、 `@javax.inject.Singleton` または `@javax.enterprise.context.ApplicationScoped` である必要があります。

source: If an existing question is of interest do upvote questions found in our discussion or like a tweet and we'll use that to prioritize the questions.
ja_jp: 既存の質問が気になる場合は、ディスカッションで見つけた質問をアップブレートしたり、ツイートに「いいね！」を押したりしてください。

source: If an existing transaction is already associated with the current thread then the transaction is suspended, then a new transaction is started which follows all the normal lifecycle rules, and when it's complete the original transaction is resumed. Otherwise, a new transaction is started, and follows all the normal lifecycle rules.
ja_jp: もし既存のトランザクションがすでに現在のスレッドと関連付けられている場合、そのトランザクションは中断され、新しいトランザクションが開始され、すべての通常のライフサイクルルールに従います。その新しいトランザクションが完了すると元のトランザクションが再開されます。現在のスレッドと関連付けられているトランザクションがなければ、新しいトランザクションが開始され、すべての通常のライフサイクルルールに従います。

source: If an expression cannot be expanded and no default is supplied a `NoSuchElementException` is thrown.
ja_jp: 式を展開できず、デフォルトが指定されていない場合、 `NoSuchElementException` が出力されます。
